Revit 2026 API

# EnergyDataSettingsCheckRangeOfShadeDepth Method

---

Checks that the shade depth is greater than or equal to zero.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CheckRangeOfShadeDepth(
	double shadeDepth
)
```
```vb
Public Shared Function CheckRangeOfShadeDepth (
	shadeDepth As Double
) As Boolean
```
```cpp
public:
static bool CheckRangeOfShadeDepth(
	double shadeDepth
)
```
```fsharp
static member CheckRangeOfShadeDepth :
        shadeDepth : float -> bool
```

#### Parameters

shadeDepth Double
     The shade depth to be checked.

#### Return Value

Boolean True if the shade depth is greater than or equal to zero, false otherwise.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace